tutorials/cylinder/simpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ 
 	 version 	 2.0; 
 	 format 	 ascii;
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 	0.01;

vertices 
( 
	 ( 0.0 -40.0 0.0 )	// 000
	 ( 40.0 -40.0 0.0 )	// 001
	 ( 40.0 40.0 0.0 )	// 002
	 ( 0.0 40.0 0.0 )	// 003
	 ( 0.0 -40.0 0.1 )	// 004
	 ( 40.0 -40.0 0.1 )	// 005
	 ( 40.0 40.0 0.1 )	// 006
	 ( 0.0 40.0 0.1 )	// 007
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	lambdaZone	( 400  800  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 1  2  6  5)
		);
	}

	symmetryTop
	{
		type symmetryPlane;
		faces
		(
			( 3  2  6  7)
		);
	}

	symmetryBot
	{
		type symmetryPlane;
		faces
		(
			( 0  1  5  4)
		);
	}

); 

mergePatchPairs 
( 
); 

