tutorials/cylinder/simpleFoam/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      forceCoeffs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceCoeffs
{
    type            forceCoeffs;
    libs            ("libforces.so");

    patches         ("cylinder");

    rho             rhoInf;
    rhoInf          1000.0;

    CofR            (0 0 0); // center of rotation (used for moments)
    dragDir         (1 0 0); // direction of flow
    liftDir         (0 1 0); // direction of lift
    pitchAxis       (0 1 0); // axis for pitching moment

    magUInf         0.5;    // freestream velocity in m/s
    lRef            1.0;   // reference length (length of the body)
    Aref            2e-05;   // frontal projected area in m^2
}
