tutorials/cylinder/simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|Phi)"
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.0;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-8;
        relTol          0.0;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    3;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    pRefCell 1001;
    pRefValue 0;
    
    //~ consistent         yes;
    consistent         no;

    outerCorrectorResidualControl
    {
		U
		{
			tolerance	1e-5;
			relTol		0;
		}
		p
		{
			tolerance	5e-4;
			relTol		0;
		}
	}
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes; //I changed this
    
    residualControl
    {
        p           1e-12;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 12;
}

relaxationFactors
{
    fields
    {
        p           0.2;
        U           0.5;
        k           0.8;
        omega       0.8;
    }
    equations
    {
        ".*" 0.85;
    }
}

PISO
{
    momentumPredictor true;
    nCorrectors     6;
    nNonOrthogonalCorrectors 2;
    pRefCell        1001;
    pRefValue       0;
}

cache
{
    grad(U);
}
// ************************************************************************* //
